benchmarks/before.out

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 

     execution: local
        script: ./benchmarks/smoke.js
        output: -

     scenarios: (100.00%) 1 scenario, 40 max VUs, 1m30s max duration (incl. graceful stop):
              * warm: 10.00 iterations/s for 1m0s (maxVUs: 40, gracefulStop: 30s)


running (0m01.0s), 00/40 VUs, 10 complete and 0 interrupted iterations
warm   [   2% ] 00/40 VUs  0m01.0s/1m0s  10.00 iters/s

running (0m02.0s), 00/40 VUs, 20 complete and 0 interrupted iterations
warm   [   3% ] 00/40 VUs  0m02.0s/1m0s  10.00 iters/s

running (0m03.0s), 00/40 VUs, 30 complete and 0 interrupted iterations
warm   [   5% ] 00/40 VUs  0m03.0s/1m0s  10.00 iters/s

running (0m04.0s), 00/40 VUs, 40 complete and 0 interrupted iterations
warm   [   7% ] 00/40 VUs  0m04.0s/1m0s  10.00 iters/s

running (0m05.0s), 00/40 VUs, 50 complete and 0 interrupted iterations
warm   [   8% ] 00/40 VUs  0m05.0s/1m0s  10.00 iters/s

running (0m06.0s), 00/40 VUs, 60 complete and 0 interrupted iterations
warm   [  10% ] 00/40 VUs  0m06.0s/1m0s  10.00 iters/s

running (0m07.0s), 00/40 VUs, 70 complete and 0 interrupted iterations
warm   [  12% ] 00/40 VUs  0m07.0s/1m0s  10.00 iters/s

running (0m08.0s), 00/40 VUs, 80 complete and 0 interrupted iterations
warm   [  13% ] 00/40 VUs  0m08.0s/1m0s  10.00 iters/s

running (0m09.0s), 00/40 VUs, 90 complete and 0 interrupted iterations
warm   [  15% ] 00/40 VUs  0m09.0s/1m0s  10.00 iters/s

running (0m10.0s), 00/40 VUs, 100 complete and 0 interrupted iterations
warm   [  17% ] 00/40 VUs  0m10.0s/1m0s  10.00 iters/s

running (0m11.0s), 00/40 VUs, 110 complete and 0 interrupted iterations
warm   [  18% ] 00/40 VUs  0m11.0s/1m0s  10.00 iters/s

running (0m12.0s), 00/40 VUs, 120 complete and 0 interrupted iterations
warm   [  20% ] 00/40 VUs  0m12.0s/1m0s  10.00 iters/s

running (0m13.0s), 00/40 VUs, 130 complete and 0 interrupted iterations
warm   [  22% ] 00/40 VUs  0m13.0s/1m0s  10.00 iters/s

running (0m14.0s), 00/40 VUs, 140 complete and 0 interrupted iterations
warm   [  23% ] 00/40 VUs  0m14.0s/1m0s  10.00 iters/s

running (0m15.0s), 00/40 VUs, 150 complete and 0 interrupted iterations
warm   [  25% ] 00/40 VUs  0m15.0s/1m0s  10.00 iters/s

running (0m16.0s), 00/40 VUs, 160 complete and 0 interrupted iterations
warm   [  27% ] 00/40 VUs  0m16.0s/1m0s  10.00 iters/s

running (0m17.0s), 00/40 VUs, 170 complete and 0 interrupted iterations
warm   [  28% ] 00/40 VUs  0m17.0s/1m0s  10.00 iters/s

running (0m18.0s), 00/40 VUs, 180 complete and 0 interrupted iterations
warm   [  30% ] 00/40 VUs  0m18.0s/1m0s  10.00 iters/s

running (0m19.0s), 00/40 VUs, 190 complete and 0 interrupted iterations
warm   [  32% ] 00/40 VUs  0m19.0s/1m0s  10.00 iters/s

running (0m20.0s), 00/40 VUs, 200 complete and 0 interrupted iterations
warm   [  33% ] 00/40 VUs  0m20.0s/1m0s  10.00 iters/s

running (0m21.0s), 00/40 VUs, 210 complete and 0 interrupted iterations
warm   [  35% ] 00/40 VUs  0m21.0s/1m0s  10.00 iters/s

running (0m22.0s), 00/40 VUs, 220 complete and 0 interrupted iterations
warm   [  37% ] 00/40 VUs  0m22.0s/1m0s  10.00 iters/s

running (0m23.0s), 00/40 VUs, 230 complete and 0 interrupted iterations
warm   [  38% ] 00/40 VUs  0m23.0s/1m0s  10.00 iters/s

running (0m24.0s), 00/40 VUs, 240 complete and 0 interrupted iterations
warm   [  40% ] 00/40 VUs  0m24.0s/1m0s  10.00 iters/s

running (0m25.0s), 00/40 VUs, 250 complete and 0 interrupted iterations
warm   [  42% ] 00/40 VUs  0m25.0s/1m0s  10.00 iters/s

running (0m26.0s), 00/40 VUs, 260 complete and 0 interrupted iterations
warm   [  43% ] 00/40 VUs  0m26.0s/1m0s  10.00 iters/s

running (0m27.0s), 00/40 VUs, 270 complete and 0 interrupted iterations
warm   [  45% ] 00/40 VUs  0m27.0s/1m0s  10.00 iters/s

running (0m28.0s), 00/40 VUs, 280 complete and 0 interrupted iterations
warm   [  47% ] 00/40 VUs  0m28.0s/1m0s  10.00 iters/s

running (0m29.0s), 00/40 VUs, 290 complete and 0 interrupted iterations
warm   [  48% ] 00/40 VUs  0m29.0s/1m0s  10.00 iters/s

running (0m30.0s), 00/40 VUs, 300 complete and 0 interrupted iterations
warm   [  50% ] 00/40 VUs  0m30.0s/1m0s  10.00 iters/s

running (0m31.0s), 00/40 VUs, 310 complete and 0 interrupted iterations
warm   [  52% ] 00/40 VUs  0m31.0s/1m0s  10.00 iters/s

running (0m32.0s), 00/40 VUs, 320 complete and 0 interrupted iterations
warm   [  53% ] 00/40 VUs  0m32.0s/1m0s  10.00 iters/s

running (0m33.0s), 00/40 VUs, 330 complete and 0 interrupted iterations
warm   [  55% ] 00/40 VUs  0m33.0s/1m0s  10.00 iters/s

running (0m34.0s), 00/40 VUs, 340 complete and 0 interrupted iterations
warm   [  57% ] 00/40 VUs  0m34.0s/1m0s  10.00 iters/s

running (0m35.0s), 00/40 VUs, 350 complete and 0 interrupted iterations
warm   [  58% ] 00/40 VUs  0m35.0s/1m0s  10.00 iters/s

running (0m36.0s), 00/40 VUs, 360 complete and 0 interrupted iterations
warm   [  60% ] 00/40 VUs  0m36.0s/1m0s  10.00 iters/s

running (0m37.0s), 00/40 VUs, 370 complete and 0 interrupted iterations
warm   [  62% ] 00/40 VUs  0m37.0s/1m0s  10.00 iters/s

running (0m38.0s), 00/40 VUs, 380 complete and 0 interrupted iterations
warm   [  63% ] 00/40 VUs  0m38.0s/1m0s  10.00 iters/s

running (0m39.0s), 00/40 VUs, 390 complete and 0 interrupted iterations
warm   [  65% ] 00/40 VUs  0m39.0s/1m0s  10.00 iters/s

running (0m40.0s), 00/40 VUs, 400 complete and 0 interrupted iterations
warm   [  67% ] 00/40 VUs  0m40.0s/1m0s  10.00 iters/s

running (0m41.0s), 00/40 VUs, 410 complete and 0 interrupted iterations
warm   [  68% ] 00/40 VUs  0m41.0s/1m0s  10.00 iters/s

running (0m42.0s), 00/40 VUs, 420 complete and 0 interrupted iterations
warm   [  70% ] 00/40 VUs  0m42.0s/1m0s  10.00 iters/s

running (0m43.0s), 00/40 VUs, 430 complete and 0 interrupted iterations
warm   [  72% ] 00/40 VUs  0m43.0s/1m0s  10.00 iters/s

running (0m44.0s), 00/40 VUs, 440 complete and 0 interrupted iterations
warm   [  73% ] 00/40 VUs  0m44.0s/1m0s  10.00 iters/s

running (0m45.0s), 00/40 VUs, 450 complete and 0 interrupted iterations
warm   [  75% ] 00/40 VUs  0m45.0s/1m0s  10.00 iters/s

running (0m46.0s), 00/40 VUs, 460 complete and 0 interrupted iterations
warm   [  77% ] 00/40 VUs  0m46.0s/1m0s  10.00 iters/s

running (0m47.0s), 00/40 VUs, 470 complete and 0 interrupted iterations
warm   [  78% ] 00/40 VUs  0m47.0s/1m0s  10.00 iters/s

running (0m48.0s), 00/40 VUs, 480 complete and 0 interrupted iterations
warm   [  80% ] 00/40 VUs  0m48.0s/1m0s  10.00 iters/s

running (0m49.0s), 00/40 VUs, 490 complete and 0 interrupted iterations
warm   [  82% ] 00/40 VUs  0m49.0s/1m0s  10.00 iters/s

running (0m50.0s), 00/40 VUs, 500 complete and 0 interrupted iterations
warm   [  83% ] 00/40 VUs  0m50.0s/1m0s  10.00 iters/s

running (0m51.0s), 00/40 VUs, 510 complete and 0 interrupted iterations
warm   [  85% ] 00/40 VUs  0m51.0s/1m0s  10.00 iters/s

running (0m52.0s), 00/40 VUs, 520 complete and 0 interrupted iterations
warm   [  87% ] 00/40 VUs  0m52.0s/1m0s  10.00 iters/s

running (0m53.0s), 00/40 VUs, 530 complete and 0 interrupted iterations
warm   [  88% ] 00/40 VUs  0m53.0s/1m0s  10.00 iters/s

running (0m54.0s), 00/40 VUs, 540 complete and 0 interrupted iterations
warm   [  90% ] 00/40 VUs  0m54.0s/1m0s  10.00 iters/s

running (0m55.0s), 00/40 VUs, 550 complete and 0 interrupted iterations
warm   [  92% ] 00/40 VUs  0m55.0s/1m0s  10.00 iters/s

running (0m56.0s), 00/40 VUs, 560 complete and 0 interrupted iterations
warm   [  93% ] 00/40 VUs  0m56.0s/1m0s  10.00 iters/s

running (0m57.0s), 00/40 VUs, 570 complete and 0 interrupted iterations
warm   [  95% ] 00/40 VUs  0m57.0s/1m0s  10.00 iters/s

running (0m58.0s), 00/40 VUs, 580 complete and 0 interrupted iterations
warm   [  97% ] 00/40 VUs  0m58.0s/1m0s  10.00 iters/s

running (0m59.0s), 00/40 VUs, 590 complete and 0 interrupted iterations
warm   [  98% ] 00/40 VUs  0m59.0s/1m0s  10.00 iters/s

running (1m00.0s), 00/40 VUs, 600 complete and 0 interrupted iterations
warm   [ 100% ] 00/40 VUs  1m00.0s/1m0s  10.00 iters/s


  █ THRESHOLDS 

    http_req_duration
    ✓ 'p(95)<200' p(95)=1.48ms

    http_req_failed
    ✓ 'rate<0.01' rate=0.00%


  █ TOTAL RESULTS 

    checks_total.......: 601     10.01622/s
    checks_succeeded...: 100.00% 601 out of 601
    checks_failed......: 0.00%   0 out of 601

    ✓ ok

    HTTP
    http_req_duration..............: avg=1.04ms min=534µs    med=878µs  max=26.01ms p(90)=1.26ms p(95)=1.48ms
      { expected_response:true }...: avg=1.04ms min=534µs    med=878µs  max=26.01ms p(90)=1.26ms p(95)=1.48ms
    http_req_failed................: 0.00%  0 out of 601
    http_reqs......................: 601    10.01622/s

    EXECUTION
    iteration_duration.............: avg=1.24ms min=664.33µs med=1.03ms max=32.32ms p(90)=1.52ms p(95)=1.81ms
    iterations.....................: 601    10.01622/s
    vus............................: 0      min=0        max=0 
    vus_max........................: 40     min=40       max=40

    NETWORK
    data_received..................: 237 kB 4.0 kB/s
    data_sent......................: 48 kB  801 B/s



running (1m00.0s), 00/40 VUs, 601 complete and 0 interrupted iterations
warm ✓ [ 100% ] 00/40 VUs  1m0s  10.00 iters/s